CSI API ETABS v1
cSelect.Group Method
 Selects or deselects all objects in the specified group.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int Group(
	string Name,
	bool Deselect = false
)
Function Group (
	Name As String,
	Optional Deselect As Boolean = false
) As Integer
Dim instance As cSelect
Dim Name As String
Dim Deselect As Boolean
Dim returnValue As Integer
returnValue = instance.Group(Name, Deselect)
int Group(
	String^ Name,
	bool Deselect = false
)
abstract Group :
        Name : string *
        ?Deselect : bool
(* Defaults:
        let _Deselect = defaultArg Deselect false
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing group.
Deselect (Optional)
Type: System.Boolean
Return Value
Type: Int32
 Returns zero if the selection is successfully completed, otherwise it returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'select group
       ret = SapModel.SelectObj.Group("ALL")
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cSelect Interface
ETABSv1 Namespace